app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'gunjan14.ictrd@gmail.com'
 LIMIT 1
---
    public function loginCheck()
    {
        $userModel = new UserModel();

        $user = $userModel->where('email', $this->request->getVar('email'))->first();