app/Controllers/ItemsController.php

    public function index()
    {
        $itemModel = new ItemModel();

        $data['items'] = $itemModel
            ->select('items.*, users.name as username')
            ->join('users', 'users.id = items.user_id', 'left')   // 👈 left join
            ->findAll();
---
SELECT `items`.*, `users`.`name` as `username`
FROM `items`
LEFT JOIN `users` ON `users`.`id` = `items`.`user_id`

    public function edit($id)
    {
        $itemModel = new ItemModel();
        $data['item'] = $itemModel->find($id);
---
SELECT *
FROM `items`
WHERE `items`.`id` = '1'